MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH169/mcu.h
extern volatile __C1RXF10bits_t C1RXF10bits __asm__ ("C1RXF10") __attribute__((section("sfrs"), address(0xBF8801E0)));
extern volatile uint32_t        C1RXF10CLR __attribute__((section("sfrs"),address(0xBF8801E4)));
extern volatile uint32_t        C1RXF10SET __attribute__((section("sfrs"),address(0xBF8801E8)));
extern volatile uint32_t        C1RXF10INV __attribute__((section("sfrs"),address(0xBF8801EC)));
#define C1RXF11 C1RXF11
extern volatile uint32_t   C1RXF11 __attribute__((section("sfrs"), address(0xBF8801F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF11bits_t;
extern volatile __C1RXF11bits_t C1RXF11bits __asm__ ("C1RXF11") __attribute__((section("sfrs"), address(0xBF8801F0)));
extern volatile uint32_t        C1RXF11CLR __attribute__((section("sfrs"),address(0xBF8801F4)));
extern volatile uint32_t        C1RXF11SET __attribute__((section("sfrs"),address(0xBF8801F8)));
extern volatile uint32_t        C1RXF11INV __attribute__((section("sfrs"),address(0xBF8801FC)));
#define C1RXF12 C1RXF12
extern volatile uint32_t   C1RXF12 __attribute__((section("sfrs"), address(0xBF880200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF12bits_t;
extern volatile __C1RXF12bits_t C1RXF12bits __asm__ ("C1RXF12") __attribute__((section("sfrs"), address(0xBF880200)));
extern volatile uint32_t        C1RXF12CLR __attribute__((section("sfrs"),address(0xBF880204)));
extern volatile uint32_t        C1RXF12SET __attribute__((section("sfrs"),address(0xBF880208)));
extern volatile uint32_t        C1RXF12INV __attribute__((section("sfrs"),address(0xBF88020C)));
#define C1RXF13 C1RXF13
extern volatile uint32_t   C1RXF13 __attribute__((section("sfrs"), address(0xBF880210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF13bits_t;
extern volatile __C1RXF13bits_t C1RXF13bits __asm__ ("C1RXF13") __attribute__((section("sfrs"), address(0xBF880210)));
extern volatile uint32_t        C1RXF13CLR __attribute__((section("sfrs"),address(0xBF880214)));
extern volatile uint32_t        C1RXF13SET __attribute__((section("sfrs"),address(0xBF880218)));
extern volatile uint32_t        C1RXF13INV __attribute__((section("sfrs"),address(0xBF88021C)));
#define C1RXF14 C1RXF14
extern volatile uint32_t   C1RXF14 __attribute__((section("sfrs"), address(0xBF880220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF14bits_t;
extern volatile __C1RXF14bits_t C1RXF14bits __asm__ ("C1RXF14") __attribute__((section("sfrs"), address(0xBF880220)));
extern volatile uint32_t        C1RXF14CLR __attribute__((section("sfrs"),address(0xBF880224)));
extern volatile uint32_t        C1RXF14SET __attribute__((section("sfrs"),address(0xBF880228)));
extern volatile uint32_t        C1RXF14INV __attribute__((section("sfrs"),address(0xBF88022C)));
#define C1RXF15 C1RXF15
extern volatile uint32_t   C1RXF15 __attribute__((section("sfrs"), address(0xBF880230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF15bits_t;
extern volatile __C1RXF15bits_t C1RXF15bits __asm__ ("C1RXF15") __attribute__((section("sfrs"), address(0xBF880230)));
extern volatile uint32_t        C1RXF15CLR __attribute__((section("sfrs"),address(0xBF880234)));
extern volatile uint32_t        C1RXF15SET __attribute__((section("sfrs"),address(0xBF880238)));
extern volatile uint32_t        C1RXF15INV __attribute__((section("sfrs"),address(0xBF88023C)));
#define C1RXF16 C1RXF16
extern volatile uint32_t   C1RXF16 __attribute__((section("sfrs"), address(0xBF880240)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF16bits_t;
extern volatile __C1RXF16bits_t C1RXF16bits __asm__ ("C1RXF16") __attribute__((section("sfrs"), address(0xBF880240)));
extern volatile uint32_t        C1RXF16CLR __attribute__((section("sfrs"),address(0xBF880244)));
extern volatile uint32_t        C1RXF16SET __attribute__((section("sfrs"),address(0xBF880248)));
extern volatile uint32_t        C1RXF16INV __attribute__((section("sfrs"),address(0xBF88024C)));
#define C1RXF17 C1RXF17
extern volatile uint32_t   C1RXF17 __attribute__((section("sfrs"), address(0xBF880250)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF17bits_t;
extern volatile __C1RXF17bits_t C1RXF17bits __asm__ ("C1RXF17") __attribute__((section("sfrs"), address(0xBF880250)));
extern volatile uint32_t        C1RXF17CLR __attribute__((section("sfrs"),address(0xBF880254)));
extern volatile uint32_t        C1RXF17SET __attribute__((section("sfrs"),address(0xBF880258)));
extern volatile uint32_t        C1RXF17INV __attribute__((section("sfrs"),address(0xBF88025C)));
#define C1RXF18 C1RXF18
extern volatile uint32_t   C1RXF18 __attribute__((section("sfrs"), address(0xBF880260)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF18bits_t;
extern volatile __C1RXF18bits_t C1RXF18bits __asm__ ("C1RXF18") __attribute__((section("sfrs"), address(0xBF880260)));
extern volatile uint32_t        C1RXF18CLR __attribute__((section("sfrs"),address(0xBF880264)));
extern volatile uint32_t        C1RXF18SET __attribute__((section("sfrs"),address(0xBF880268)));
extern volatile uint32_t        C1RXF18INV __attribute__((section("sfrs"),address(0xBF88026C)));
#define C1RXF19 C1RXF19
extern volatile uint32_t   C1RXF19 __attribute__((section("sfrs"), address(0xBF880270)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF19bits_t;
extern volatile __C1RXF19bits_t C1RXF19bits __asm__ ("C1RXF19") __attribute__((section("sfrs"), address(0xBF880270)));
extern volatile uint32_t        C1RXF19CLR __attribute__((section("sfrs"),address(0xBF880274)));
extern volatile uint32_t        C1RXF19SET __attribute__((section("sfrs"),address(0xBF880278)));
extern volatile uint32_t        C1RXF19INV __attribute__((section("sfrs"),address(0xBF88027C)));
#define C1RXF20 C1RXF20
extern volatile uint32_t   C1RXF20 __attribute__((section("sfrs"), address(0xBF880280)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF20bits_t;
