MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH169/mcu.h
#define _DDRDLYCFG0_W2RDLY_POSITION              0x00000000
#define _DDRDLYCFG0_W2RDLY_MASK                  0x0000000F
#define _DDRDLYCFG0_W2RDLY_LENGTH                0x00000004

#define _DDRDLYCFG0_W2RCSDLY_POSITION            0x00000004
#define _DDRDLYCFG0_W2RCSDLY_MASK                0x000000F0
#define _DDRDLYCFG0_W2RCSDLY_LENGTH              0x00000004

#define _DDRDLYCFG0_R2RDLY_POSITION              0x00000008
#define _DDRDLYCFG0_R2RDLY_MASK                  0x00000F00
#define _DDRDLYCFG0_R2RDLY_LENGTH                0x00000004

#define _DDRDLYCFG0_R2RCSDLY_POSITION            0x0000000C
#define _DDRDLYCFG0_R2RCSDLY_MASK                0x0000F000
#define _DDRDLYCFG0_R2RCSDLY_LENGTH              0x00000004

#define _DDRDLYCFG0_W2WDLY_POSITION              0x00000010
#define _DDRDLYCFG0_W2WDLY_MASK                  0x000F0000
#define _DDRDLYCFG0_W2WDLY_LENGTH                0x00000004

#define _DDRDLYCFG0_W2WCSDLY_POSITION            0x00000014
#define _DDRDLYCFG0_W2WCSDLY_MASK                0x00F00000
#define _DDRDLYCFG0_W2WCSDLY_LENGTH              0x00000004

#define _DDRDLYCFG0_R2WDLY_POSITION              0x00000018
#define _DDRDLYCFG0_R2WDLY_MASK                  0x0F000000
#define _DDRDLYCFG0_R2WDLY_LENGTH                0x00000004

#define _DDRDLYCFG0_RMWDLY_POSITION              0x0000001C
#define _DDRDLYCFG0_RMWDLY_MASK                  0xF0000000
#define _DDRDLYCFG0_RMWDLY_LENGTH                0x00000004

#define _DDRDLYCFG1_SLFREFMINDLY_POSITION        0x00000000
#define _DDRDLYCFG1_SLFREFMINDLY_MASK            0x000000FF
#define _DDRDLYCFG1_SLFREFMINDLY_LENGTH          0x00000008

#define _DDRDLYCFG1_SLFREFEXDLY_POSITION         0x00000008
#define _DDRDLYCFG1_SLFREFEXDLY_MASK             0x0000FF00
#define _DDRDLYCFG1_SLFREFEXDLY_LENGTH           0x00000008

#define _DDRDLYCFG1_PWRDNMINDLY_POSITION         0x00000010
#define _DDRDLYCFG1_PWRDNMINDLY_MASK             0x000F0000
#define _DDRDLYCFG1_PWRDNMINDLY_LENGTH           0x00000004

#define _DDRDLYCFG1_PWRDNEXDLY_POSITION          0x00000014
#define _DDRDLYCFG1_PWRDNEXDLY_MASK              0x03F00000
#define _DDRDLYCFG1_PWRDNEXDLY_LENGTH            0x00000006

#define _DDRDLYCFG1_W2PCHRGDLY4_POSITION         0x0000001A
#define _DDRDLYCFG1_W2PCHRGDLY4_MASK             0x04000000
#define _DDRDLYCFG1_W2PCHRGDLY4_LENGTH           0x00000001

#define _DDRDLYCFG1_W2RDLY4_POSITION             0x0000001B
#define _DDRDLYCFG1_W2RDLY4_MASK                 0x08000000
#define _DDRDLYCFG1_W2RDLY4_LENGTH               0x00000001

#define _DDRDLYCFG1_W2RCSDLY4_POSITION           0x0000001C
#define _DDRDLYCFG1_W2RCSDLY4_MASK               0x10000000
#define _DDRDLYCFG1_W2RCSDLY4_LENGTH             0x00000001

#define _DDRDLYCFG1_NXTDATAVDLY4_POSITION        0x0000001D
#define _DDRDLYCFG1_NXTDATAVDLY4_MASK            0x20000000
#define _DDRDLYCFG1_NXTDATAVDLY4_LENGTH          0x00000001

#define _DDRDLYCFG1_SLFREFEXDLY8_POSITION        0x0000001E
#define _DDRDLYCFG1_SLFREFEXDLY8_MASK            0x40000000
#define _DDRDLYCFG1_SLFREFEXDLY8_LENGTH          0x00000001

#define _DDRDLYCFG2_PCHRGALLDLY_POSITION         0x00000000
#define _DDRDLYCFG2_PCHRGALLDLY_MASK             0x0000000F
#define _DDRDLYCFG2_PCHRGALLDLY_LENGTH           0x00000004

#define _DDRDLYCFG2_R2PCHRGDLY_POSITION          0x00000008
#define _DDRDLYCFG2_R2PCHRGDLY_MASK              0x00000F00
#define _DDRDLYCFG2_R2PCHRGDLY_LENGTH            0x00000004

#define _DDRDLYCFG2_W2PCHRGDLY_POSITION          0x0000000C
#define _DDRDLYCFG2_W2PCHRGDLY_MASK              0x0000F000
#define _DDRDLYCFG2_W2PCHRGDLY_LENGTH            0x00000004

#define _DDRDLYCFG2_RAS2RASDLY_POSITION          0x00000010
#define _DDRDLYCFG2_RAS2RASDLY_MASK              0x000F0000
#define _DDRDLYCFG2_RAS2RASDLY_LENGTH            0x00000004

#define _DDRDLYCFG2_RAS2CASDLY_POSITION          0x00000014
#define _DDRDLYCFG2_RAS2CASDLY_MASK              0x00F00000
#define _DDRDLYCFG2_RAS2CASDLY_LENGTH            0x00000004

#define _DDRDLYCFG2_PCHRG2RASDLY_POSITION        0x00000018
#define _DDRDLYCFG2_PCHRG2RASDLY_MASK            0x0F000000
#define _DDRDLYCFG2_PCHRG2RASDLY_LENGTH          0x00000004

#define _DDRDLYCFG2_RBENDDLY_POSITION            0x0000001C
#define _DDRDLYCFG2_RBENDDLY_MASK                0xF0000000
#define _DDRDLYCFG2_RBENDDLY_LENGTH              0x00000004

#define _DDRDLYCFG3_RAS2PCHRGDLY_POSITION        0x00000000
#define _DDRDLYCFG3_RAS2PCHRGDLY_MASK            0x0000001F
#define _DDRDLYCFG3_RAS2PCHRGDLY_LENGTH          0x00000005

#define _DDRDLYCFG3_RAS2RASSBNKDLY_POSITION      0x00000008
#define _DDRDLYCFG3_RAS2RASSBNKDLY_MASK          0x00003F00
#define _DDRDLYCFG3_RAS2RASSBNKDLY_LENGTH        0x00000006

#define _DDRDLYCFG3_FAWTDLY_POSITION             0x00000010
#define _DDRDLYCFG3_FAWTDLY_MASK                 0x003F0000
#define _DDRDLYCFG3_FAWTDLY_LENGTH               0x00000006

#define _DDRODTCFG_ODTCSEN_POSITION              0x00000000
#define _DDRODTCFG_ODTCSEN_MASK                  0x000000FF
#define _DDRODTCFG_ODTCSEN_LENGTH                0x00000008

#define _DDRODTCFG_ODTRDLY_POSITION              0x00000008
#define _DDRODTCFG_ODTRDLY_MASK                  0x00000F00
#define _DDRODTCFG_ODTRDLY_LENGTH                0x00000004

#define _DDRODTCFG_ODTWDLY_POSITION              0x0000000C
#define _DDRODTCFG_ODTWDLY_MASK                  0x0000F000
#define _DDRODTCFG_ODTWDLY_LENGTH                0x00000004

#define _DDRODTCFG_ODTRLEN_POSITION              0x00000010
#define _DDRODTCFG_ODTRLEN_MASK                  0x00070000
#define _DDRODTCFG_ODTRLEN_LENGTH                0x00000003

#define _DDRODTCFG_ODTWLEN_POSITION              0x00000014
#define _DDRODTCFG_ODTWLEN_MASK                  0x00700000
#define _DDRODTCFG_ODTWLEN_LENGTH                0x00000003

#define _DDRXFERCFG_NXTDATRQDLY_POSITION         0x00000000
#define _DDRXFERCFG_NXTDATRQDLY_MASK             0x0000000F
#define _DDRXFERCFG_NXTDATRQDLY_LENGTH           0x00000004

#define _DDRXFERCFG_NXTDATAVDLY_POSITION         0x00000004
#define _DDRXFERCFG_NXTDATAVDLY_MASK             0x000000F0
#define _DDRXFERCFG_NXTDATAVDLY_LENGTH           0x00000004

#define _DDRXFERCFG_RDATENDLY_POSITION           0x00000010
#define _DDRXFERCFG_RDATENDLY_MASK               0x000F0000
#define _DDRXFERCFG_RDATENDLY_LENGTH             0x00000004

#define _DDRXFERCFG_MAXBURST_POSITION            0x00000018
#define _DDRXFERCFG_MAXBURST_MASK                0x0F000000
#define _DDRXFERCFG_MAXBURST_LENGTH              0x00000004

#define _DDRXFERCFG_BIGENDIAN_POSITION           0x0000001F
#define _DDRXFERCFG_BIGENDIAN_MASK               0x80000000
#define _DDRXFERCFG_BIGENDIAN_LENGTH             0x00000001

#define _DDRCMDISSUE_NUMHOSTCMDS_POSITION        0x00000000
#define _DDRCMDISSUE_NUMHOSTCMDS_MASK            0x0000000F
#define _DDRCMDISSUE_NUMHOSTCMDS_LENGTH          0x00000004

#define _DDRCMDISSUE_VALID_POSITION              0x00000004
#define _DDRCMDISSUE_VALID_MASK                  0x00000010
#define _DDRCMDISSUE_VALID_LENGTH                0x00000001

#define _DDRODTENCFG_ODTREN_POSITION             0x00000000
#define _DDRODTENCFG_ODTREN_MASK                 0x00000001
#define _DDRODTENCFG_ODTREN_LENGTH               0x00000001

#define _DDRODTENCFG_ODTWEN_POSITION             0x00000010
#define _DDRODTENCFG_ODTWEN_MASK                 0x00010000
#define _DDRODTENCFG_ODTWEN_LENGTH               0x00000001

#define _DDRMEMWIDTH_HALFRATE_POSITION           0x00000003
#define _DDRMEMWIDTH_HALFRATE_MASK               0x00000008
#define _DDRMEMWIDTH_HALFRATE_LENGTH             0x00000001

