MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH169/mcu.h
#define _GLCDCLUT30_RED_POSITION                 0x00000010
#define _GLCDCLUT30_RED_MASK                     0x00FF0000
#define _GLCDCLUT30_RED_LENGTH                   0x00000008

#define _GLCDCLUT31_BLUE_POSITION                0x00000000
#define _GLCDCLUT31_BLUE_MASK                    0x000000FF
#define _GLCDCLUT31_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT31_GREEN_POSITION               0x00000008
#define _GLCDCLUT31_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT31_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT31_RED_POSITION                 0x00000010
#define _GLCDCLUT31_RED_MASK                     0x00FF0000
#define _GLCDCLUT31_RED_LENGTH                   0x00000008

#define _GLCDCLUT32_BLUE_POSITION                0x00000000
#define _GLCDCLUT32_BLUE_MASK                    0x000000FF
#define _GLCDCLUT32_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT32_GREEN_POSITION               0x00000008
#define _GLCDCLUT32_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT32_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT32_RED_POSITION                 0x00000010
#define _GLCDCLUT32_RED_MASK                     0x00FF0000
#define _GLCDCLUT32_RED_LENGTH                   0x00000008

#define _GLCDCLUT33_BLUE_POSITION                0x00000000
#define _GLCDCLUT33_BLUE_MASK                    0x000000FF
#define _GLCDCLUT33_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT33_GREEN_POSITION               0x00000008
#define _GLCDCLUT33_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT33_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT33_RED_POSITION                 0x00000010
#define _GLCDCLUT33_RED_MASK                     0x00FF0000
#define _GLCDCLUT33_RED_LENGTH                   0x00000008

#define _GLCDCLUT34_BLUE_POSITION                0x00000000
#define _GLCDCLUT34_BLUE_MASK                    0x000000FF
#define _GLCDCLUT34_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT34_GREEN_POSITION               0x00000008
#define _GLCDCLUT34_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT34_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT34_RED_POSITION                 0x00000010
#define _GLCDCLUT34_RED_MASK                     0x00FF0000
#define _GLCDCLUT34_RED_LENGTH                   0x00000008

#define _GLCDCLUT35_BLUE_POSITION                0x00000000
#define _GLCDCLUT35_BLUE_MASK                    0x000000FF
#define _GLCDCLUT35_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT35_GREEN_POSITION               0x00000008
#define _GLCDCLUT35_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT35_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT35_RED_POSITION                 0x00000010
#define _GLCDCLUT35_RED_MASK                     0x00FF0000
#define _GLCDCLUT35_RED_LENGTH                   0x00000008

#define _GLCDCLUT36_BLUE_POSITION                0x00000000
#define _GLCDCLUT36_BLUE_MASK                    0x000000FF
#define _GLCDCLUT36_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT36_GREEN_POSITION               0x00000008
#define _GLCDCLUT36_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT36_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT36_RED_POSITION                 0x00000010
#define _GLCDCLUT36_RED_MASK                     0x00FF0000
#define _GLCDCLUT36_RED_LENGTH                   0x00000008

#define _GLCDCLUT37_BLUE_POSITION                0x00000000
#define _GLCDCLUT37_BLUE_MASK                    0x000000FF
#define _GLCDCLUT37_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT37_GREEN_POSITION               0x00000008
#define _GLCDCLUT37_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT37_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT37_RED_POSITION                 0x00000010
#define _GLCDCLUT37_RED_MASK                     0x00FF0000
#define _GLCDCLUT37_RED_LENGTH                   0x00000008

#define _GLCDCLUT38_BLUE_POSITION                0x00000000
#define _GLCDCLUT38_BLUE_MASK                    0x000000FF
#define _GLCDCLUT38_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT38_GREEN_POSITION               0x00000008
#define _GLCDCLUT38_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT38_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT38_RED_POSITION                 0x00000010
#define _GLCDCLUT38_RED_MASK                     0x00FF0000
#define _GLCDCLUT38_RED_LENGTH                   0x00000008

#define _GLCDCLUT39_BLUE_POSITION                0x00000000
#define _GLCDCLUT39_BLUE_MASK                    0x000000FF
#define _GLCDCLUT39_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT39_GREEN_POSITION               0x00000008
#define _GLCDCLUT39_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT39_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT39_RED_POSITION                 0x00000010
#define _GLCDCLUT39_RED_MASK                     0x00FF0000
#define _GLCDCLUT39_RED_LENGTH                   0x00000008

#define _GLCDCLUT40_BLUE_POSITION                0x00000000
#define _GLCDCLUT40_BLUE_MASK                    0x000000FF
#define _GLCDCLUT40_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT40_GREEN_POSITION               0x00000008
#define _GLCDCLUT40_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT40_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT40_RED_POSITION                 0x00000010
#define _GLCDCLUT40_RED_MASK                     0x00FF0000
#define _GLCDCLUT40_RED_LENGTH                   0x00000008

#define _GLCDCLUT41_BLUE_POSITION                0x00000000
#define _GLCDCLUT41_BLUE_MASK                    0x000000FF
#define _GLCDCLUT41_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT41_GREEN_POSITION               0x00000008
#define _GLCDCLUT41_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT41_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT41_RED_POSITION                 0x00000010
#define _GLCDCLUT41_RED_MASK                     0x00FF0000
#define _GLCDCLUT41_RED_LENGTH                   0x00000008

#define _GLCDCLUT42_BLUE_POSITION                0x00000000
#define _GLCDCLUT42_BLUE_MASK                    0x000000FF
#define _GLCDCLUT42_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT42_GREEN_POSITION               0x00000008
#define _GLCDCLUT42_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT42_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT42_RED_POSITION                 0x00000010
#define _GLCDCLUT42_RED_MASK                     0x00FF0000
#define _GLCDCLUT42_RED_LENGTH                   0x00000008

#define _GLCDCLUT43_BLUE_POSITION                0x00000000
#define _GLCDCLUT43_BLUE_MASK                    0x000000FF
#define _GLCDCLUT43_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT43_GREEN_POSITION               0x00000008
#define _GLCDCLUT43_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT43_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT43_RED_POSITION                 0x00000010
#define _GLCDCLUT43_RED_MASK                     0x00FF0000
#define _GLCDCLUT43_RED_LENGTH                   0x00000008

#define _GLCDCLUT44_BLUE_POSITION                0x00000000
#define _GLCDCLUT44_BLUE_MASK                    0x000000FF
#define _GLCDCLUT44_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT44_GREEN_POSITION               0x00000008
#define _GLCDCLUT44_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT44_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT44_RED_POSITION                 0x00000010
#define _GLCDCLUT44_RED_MASK                     0x00FF0000
#define _GLCDCLUT44_RED_LENGTH                   0x00000008

#define _GLCDCLUT45_BLUE_POSITION                0x00000000
#define _GLCDCLUT45_BLUE_MASK                    0x000000FF
#define _GLCDCLUT45_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT45_GREEN_POSITION               0x00000008
#define _GLCDCLUT45_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT45_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT45_RED_POSITION                 0x00000010
#define _GLCDCLUT45_RED_MASK                     0x00FF0000
#define _GLCDCLUT45_RED_LENGTH                   0x00000008

