MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH169/mcu.h
#define _GLCDCLUT185_BLUE_POSITION               0x00000000
#define _GLCDCLUT185_BLUE_MASK                   0x000000FF
#define _GLCDCLUT185_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT185_GREEN_POSITION              0x00000008
#define _GLCDCLUT185_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT185_GREEN_LENGTH                0x00000008

#define _GLCDCLUT185_RED_POSITION                0x00000010
#define _GLCDCLUT185_RED_MASK                    0x00FF0000
#define _GLCDCLUT185_RED_LENGTH                  0x00000008

#define _GLCDCLUT186_BLUE_POSITION               0x00000000
#define _GLCDCLUT186_BLUE_MASK                   0x000000FF
#define _GLCDCLUT186_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT186_GREEN_POSITION              0x00000008
#define _GLCDCLUT186_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT186_GREEN_LENGTH                0x00000008

#define _GLCDCLUT186_RED_POSITION                0x00000010
#define _GLCDCLUT186_RED_MASK                    0x00FF0000
#define _GLCDCLUT186_RED_LENGTH                  0x00000008

#define _GLCDCLUT187_BLUE_POSITION               0x00000000
#define _GLCDCLUT187_BLUE_MASK                   0x000000FF
#define _GLCDCLUT187_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT187_GREEN_POSITION              0x00000008
#define _GLCDCLUT187_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT187_GREEN_LENGTH                0x00000008

#define _GLCDCLUT187_RED_POSITION                0x00000010
#define _GLCDCLUT187_RED_MASK                    0x00FF0000
#define _GLCDCLUT187_RED_LENGTH                  0x00000008

#define _GLCDCLUT188_BLUE_POSITION               0x00000000
#define _GLCDCLUT188_BLUE_MASK                   0x000000FF
#define _GLCDCLUT188_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT188_GREEN_POSITION              0x00000008
#define _GLCDCLUT188_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT188_GREEN_LENGTH                0x00000008

#define _GLCDCLUT188_RED_POSITION                0x00000010
#define _GLCDCLUT188_RED_MASK                    0x00FF0000
#define _GLCDCLUT188_RED_LENGTH                  0x00000008

#define _GLCDCLUT189_BLUE_POSITION               0x00000000
#define _GLCDCLUT189_BLUE_MASK                   0x000000FF
#define _GLCDCLUT189_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT189_GREEN_POSITION              0x00000008
#define _GLCDCLUT189_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT189_GREEN_LENGTH                0x00000008

#define _GLCDCLUT189_RED_POSITION                0x00000010
#define _GLCDCLUT189_RED_MASK                    0x00FF0000
#define _GLCDCLUT189_RED_LENGTH                  0x00000008

#define _GLCDCLUT190_BLUE_POSITION               0x00000000
#define _GLCDCLUT190_BLUE_MASK                   0x000000FF
#define _GLCDCLUT190_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT190_GREEN_POSITION              0x00000008
#define _GLCDCLUT190_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT190_GREEN_LENGTH                0x00000008

#define _GLCDCLUT190_RED_POSITION                0x00000010
#define _GLCDCLUT190_RED_MASK                    0x00FF0000
#define _GLCDCLUT190_RED_LENGTH                  0x00000008

#define _GLCDCLUT191_BLUE_POSITION               0x00000000
#define _GLCDCLUT191_BLUE_MASK                   0x000000FF
#define _GLCDCLUT191_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT191_GREEN_POSITION              0x00000008
#define _GLCDCLUT191_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT191_GREEN_LENGTH                0x00000008

#define _GLCDCLUT191_RED_POSITION                0x00000010
#define _GLCDCLUT191_RED_MASK                    0x00FF0000
#define _GLCDCLUT191_RED_LENGTH                  0x00000008

#define _GLCDCLUT192_BLUE_POSITION               0x00000000
#define _GLCDCLUT192_BLUE_MASK                   0x000000FF
#define _GLCDCLUT192_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT192_GREEN_POSITION              0x00000008
#define _GLCDCLUT192_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT192_GREEN_LENGTH                0x00000008

#define _GLCDCLUT192_RED_POSITION                0x00000010
#define _GLCDCLUT192_RED_MASK                    0x00FF0000
#define _GLCDCLUT192_RED_LENGTH                  0x00000008

#define _GLCDCLUT193_BLUE_POSITION               0x00000000
#define _GLCDCLUT193_BLUE_MASK                   0x000000FF
#define _GLCDCLUT193_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT193_GREEN_POSITION              0x00000008
#define _GLCDCLUT193_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT193_GREEN_LENGTH                0x00000008

#define _GLCDCLUT193_RED_POSITION                0x00000010
#define _GLCDCLUT193_RED_MASK                    0x00FF0000
#define _GLCDCLUT193_RED_LENGTH                  0x00000008

#define _GLCDCLUT194_BLUE_POSITION               0x00000000
#define _GLCDCLUT194_BLUE_MASK                   0x000000FF
#define _GLCDCLUT194_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT194_GREEN_POSITION              0x00000008
#define _GLCDCLUT194_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT194_GREEN_LENGTH                0x00000008

#define _GLCDCLUT194_RED_POSITION                0x00000010
#define _GLCDCLUT194_RED_MASK                    0x00FF0000
#define _GLCDCLUT194_RED_LENGTH                  0x00000008

#define _GLCDCLUT195_BLUE_POSITION               0x00000000
#define _GLCDCLUT195_BLUE_MASK                   0x000000FF
#define _GLCDCLUT195_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT195_GREEN_POSITION              0x00000008
#define _GLCDCLUT195_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT195_GREEN_LENGTH                0x00000008

#define _GLCDCLUT195_RED_POSITION                0x00000010
#define _GLCDCLUT195_RED_MASK                    0x00FF0000
#define _GLCDCLUT195_RED_LENGTH                  0x00000008

#define _GLCDCLUT196_BLUE_POSITION               0x00000000
#define _GLCDCLUT196_BLUE_MASK                   0x000000FF
#define _GLCDCLUT196_BLUE_LENGTH                 0x00000008

