MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH169/mcu.h
#define _GLCDCURDATA72_PIXEL180_POSITION         0x0000001C
#define _GLCDCURDATA72_PIXEL180_MASK             0xF0000000
#define _GLCDCURDATA72_PIXEL180_LENGTH           0x00000004

#define _GLCDCURDATA73_PIXEL1815_POSITION        0x00000000
#define _GLCDCURDATA73_PIXEL1815_MASK            0x0000000F
#define _GLCDCURDATA73_PIXEL1815_LENGTH          0x00000004

#define _GLCDCURDATA73_PIXEL1814_POSITION        0x00000004
#define _GLCDCURDATA73_PIXEL1814_MASK            0x000000F0
#define _GLCDCURDATA73_PIXEL1814_LENGTH          0x00000004

#define _GLCDCURDATA73_PIXEL1813_POSITION        0x00000008
#define _GLCDCURDATA73_PIXEL1813_MASK            0x00000F00
#define _GLCDCURDATA73_PIXEL1813_LENGTH          0x00000004

#define _GLCDCURDATA73_PIXEL1812_POSITION        0x0000000C
#define _GLCDCURDATA73_PIXEL1812_MASK            0x0000F000
#define _GLCDCURDATA73_PIXEL1812_LENGTH          0x00000004

#define _GLCDCURDATA73_PIXEL1811_POSITION        0x00000010
#define _GLCDCURDATA73_PIXEL1811_MASK            0x000F0000
#define _GLCDCURDATA73_PIXEL1811_LENGTH          0x00000004

#define _GLCDCURDATA73_PIXEL1810_POSITION        0x00000014
#define _GLCDCURDATA73_PIXEL1810_MASK            0x00F00000
#define _GLCDCURDATA73_PIXEL1810_LENGTH          0x00000004

#define _GLCDCURDATA73_PIXEL189_POSITION         0x00000018
#define _GLCDCURDATA73_PIXEL189_MASK             0x0F000000
#define _GLCDCURDATA73_PIXEL189_LENGTH           0x00000004

#define _GLCDCURDATA73_PIXEL188_POSITION         0x0000001C
#define _GLCDCURDATA73_PIXEL188_MASK             0xF0000000
#define _GLCDCURDATA73_PIXEL188_LENGTH           0x00000004

#define _GLCDCURDATA74_PIXEL1823_POSITION        0x00000000
#define _GLCDCURDATA74_PIXEL1823_MASK            0x0000000F
#define _GLCDCURDATA74_PIXEL1823_LENGTH          0x00000004

#define _GLCDCURDATA74_PIXEL1822_POSITION        0x00000004
#define _GLCDCURDATA74_PIXEL1822_MASK            0x000000F0
#define _GLCDCURDATA74_PIXEL1822_LENGTH          0x00000004

#define _GLCDCURDATA74_PIXEL1821_POSITION        0x00000008
#define _GLCDCURDATA74_PIXEL1821_MASK            0x00000F00
#define _GLCDCURDATA74_PIXEL1821_LENGTH          0x00000004

#define _GLCDCURDATA74_PIXEL1820_POSITION        0x0000000C
#define _GLCDCURDATA74_PIXEL1820_MASK            0x0000F000
#define _GLCDCURDATA74_PIXEL1820_LENGTH          0x00000004

#define _GLCDCURDATA74_PIXEL1819_POSITION        0x00000010
#define _GLCDCURDATA74_PIXEL1819_MASK            0x000F0000
#define _GLCDCURDATA74_PIXEL1819_LENGTH          0x00000004

#define _GLCDCURDATA74_PIXEL1818_POSITION        0x00000014
#define _GLCDCURDATA74_PIXEL1818_MASK            0x00F00000
#define _GLCDCURDATA74_PIXEL1818_LENGTH          0x00000004

#define _GLCDCURDATA74_PIXEL1817_POSITION        0x00000018
#define _GLCDCURDATA74_PIXEL1817_MASK            0x0F000000
#define _GLCDCURDATA74_PIXEL1817_LENGTH          0x00000004

#define _GLCDCURDATA74_PIXEL1816_POSITION        0x0000001C
#define _GLCDCURDATA74_PIXEL1816_MASK            0xF0000000
#define _GLCDCURDATA74_PIXEL1816_LENGTH          0x00000004

#define _GLCDCURDATA75_PIXEL1831_POSITION        0x00000000
#define _GLCDCURDATA75_PIXEL1831_MASK            0x0000000F
#define _GLCDCURDATA75_PIXEL1831_LENGTH          0x00000004

#define _GLCDCURDATA75_PIXEL1830_POSITION        0x00000004
#define _GLCDCURDATA75_PIXEL1830_MASK            0x000000F0
#define _GLCDCURDATA75_PIXEL1830_LENGTH          0x00000004

#define _GLCDCURDATA75_PIXEL1829_POSITION        0x00000008
#define _GLCDCURDATA75_PIXEL1829_MASK            0x00000F00
#define _GLCDCURDATA75_PIXEL1829_LENGTH          0x00000004

#define _GLCDCURDATA75_PIXEL1828_POSITION        0x0000000C
#define _GLCDCURDATA75_PIXEL1828_MASK            0x0000F000
#define _GLCDCURDATA75_PIXEL1828_LENGTH          0x00000004

#define _GLCDCURDATA75_PIXEL1827_POSITION        0x00000010
#define _GLCDCURDATA75_PIXEL1827_MASK            0x000F0000
#define _GLCDCURDATA75_PIXEL1827_LENGTH          0x00000004

#define _GLCDCURDATA75_PIXEL1826_POSITION        0x00000014
#define _GLCDCURDATA75_PIXEL1826_MASK            0x00F00000
#define _GLCDCURDATA75_PIXEL1826_LENGTH          0x00000004

#define _GLCDCURDATA75_PIXEL1825_POSITION        0x00000018
#define _GLCDCURDATA75_PIXEL1825_MASK            0x0F000000
#define _GLCDCURDATA75_PIXEL1825_LENGTH          0x00000004

#define _GLCDCURDATA75_PIXEL1824_POSITION        0x0000001C
#define _GLCDCURDATA75_PIXEL1824_MASK            0xF0000000
#define _GLCDCURDATA75_PIXEL1824_LENGTH          0x00000004

#define _GLCDCURDATA76_PIXEL197_POSITION         0x00000000
#define _GLCDCURDATA76_PIXEL197_MASK             0x0000000F
#define _GLCDCURDATA76_PIXEL197_LENGTH           0x00000004

#define _GLCDCURDATA76_PIXEL196_POSITION         0x00000004
#define _GLCDCURDATA76_PIXEL196_MASK             0x000000F0
#define _GLCDCURDATA76_PIXEL196_LENGTH           0x00000004

#define _GLCDCURDATA76_PIXEL195_POSITION         0x00000008
#define _GLCDCURDATA76_PIXEL195_MASK             0x00000F00
#define _GLCDCURDATA76_PIXEL195_LENGTH           0x00000004

#define _GLCDCURDATA76_PIXEL194_POSITION         0x0000000C
#define _GLCDCURDATA76_PIXEL194_MASK             0x0000F000
#define _GLCDCURDATA76_PIXEL194_LENGTH           0x00000004

#define _GLCDCURDATA76_PIXEL193_POSITION         0x00000010
#define _GLCDCURDATA76_PIXEL193_MASK             0x000F0000
#define _GLCDCURDATA76_PIXEL193_LENGTH           0x00000004

#define _GLCDCURDATA76_PIXEL192_POSITION         0x00000014
#define _GLCDCURDATA76_PIXEL192_MASK             0x00F00000
#define _GLCDCURDATA76_PIXEL192_LENGTH           0x00000004

#define _GLCDCURDATA76_PIXEL191_POSITION         0x00000018
#define _GLCDCURDATA76_PIXEL191_MASK             0x0F000000
#define _GLCDCURDATA76_PIXEL191_LENGTH           0x00000004

#define _GLCDCURDATA76_PIXEL190_POSITION         0x0000001C
#define _GLCDCURDATA76_PIXEL190_MASK             0xF0000000
#define _GLCDCURDATA76_PIXEL190_LENGTH           0x00000004

#define _GLCDCURDATA77_PIXEL1915_POSITION        0x00000000
#define _GLCDCURDATA77_PIXEL1915_MASK            0x0000000F
#define _GLCDCURDATA77_PIXEL1915_LENGTH          0x00000004

#define _GLCDCURDATA77_PIXEL1914_POSITION        0x00000004
#define _GLCDCURDATA77_PIXEL1914_MASK            0x000000F0
#define _GLCDCURDATA77_PIXEL1914_LENGTH          0x00000004

#define _GLCDCURDATA77_PIXEL1913_POSITION        0x00000008
#define _GLCDCURDATA77_PIXEL1913_MASK            0x00000F00
#define _GLCDCURDATA77_PIXEL1913_LENGTH          0x00000004

#define _GLCDCURDATA77_PIXEL1912_POSITION        0x0000000C
#define _GLCDCURDATA77_PIXEL1912_MASK            0x0000F000
#define _GLCDCURDATA77_PIXEL1912_LENGTH          0x00000004

#define _GLCDCURDATA77_PIXEL1911_POSITION        0x00000010
#define _GLCDCURDATA77_PIXEL1911_MASK            0x000F0000
#define _GLCDCURDATA77_PIXEL1911_LENGTH          0x00000004

#define _GLCDCURDATA77_PIXEL1910_POSITION        0x00000014
#define _GLCDCURDATA77_PIXEL1910_MASK            0x00F00000
#define _GLCDCURDATA77_PIXEL1910_LENGTH          0x00000004

#define _GLCDCURDATA77_PIXEL199_POSITION         0x00000018
#define _GLCDCURDATA77_PIXEL199_MASK             0x0F000000
#define _GLCDCURDATA77_PIXEL199_LENGTH           0x00000004

#define _GLCDCURDATA77_PIXEL198_POSITION         0x0000001C
#define _GLCDCURDATA77_PIXEL198_MASK             0xF0000000
#define _GLCDCURDATA77_PIXEL198_LENGTH           0x00000004

#define _GLCDCURDATA78_PIXEL1923_POSITION        0x00000000
#define _GLCDCURDATA78_PIXEL1923_MASK            0x0000000F
#define _GLCDCURDATA78_PIXEL1923_LENGTH          0x00000004

#define _GLCDCURDATA78_PIXEL1922_POSITION        0x00000004
#define _GLCDCURDATA78_PIXEL1922_MASK            0x000000F0
#define _GLCDCURDATA78_PIXEL1922_LENGTH          0x00000004

#define _GLCDCURDATA78_PIXEL1921_POSITION        0x00000008
#define _GLCDCURDATA78_PIXEL1921_MASK            0x00000F00
#define _GLCDCURDATA78_PIXEL1921_LENGTH          0x00000004

#define _GLCDCURDATA78_PIXEL1920_POSITION        0x0000000C
#define _GLCDCURDATA78_PIXEL1920_MASK            0x0000F000
#define _GLCDCURDATA78_PIXEL1920_LENGTH          0x00000004

#define _GLCDCURDATA78_PIXEL1919_POSITION        0x00000010
#define _GLCDCURDATA78_PIXEL1919_MASK            0x000F0000
#define _GLCDCURDATA78_PIXEL1919_LENGTH          0x00000004

#define _GLCDCURDATA78_PIXEL1918_POSITION        0x00000014
#define _GLCDCURDATA78_PIXEL1918_MASK            0x00F00000
#define _GLCDCURDATA78_PIXEL1918_LENGTH          0x00000004

#define _GLCDCURDATA78_PIXEL1917_POSITION        0x00000018
#define _GLCDCURDATA78_PIXEL1917_MASK            0x0F000000
#define _GLCDCURDATA78_PIXEL1917_LENGTH          0x00000004

