MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAH169/mcu.h
#define _GLCDCURDATA97_PIXEL2415_POSITION        0x00000000
#define _GLCDCURDATA97_PIXEL2415_MASK            0x0000000F
#define _GLCDCURDATA97_PIXEL2415_LENGTH          0x00000004

#define _GLCDCURDATA97_PIXEL2414_POSITION        0x00000004
#define _GLCDCURDATA97_PIXEL2414_MASK            0x000000F0
#define _GLCDCURDATA97_PIXEL2414_LENGTH          0x00000004

#define _GLCDCURDATA97_PIXEL2413_POSITION        0x00000008
#define _GLCDCURDATA97_PIXEL2413_MASK            0x00000F00
#define _GLCDCURDATA97_PIXEL2413_LENGTH          0x00000004

#define _GLCDCURDATA97_PIXEL2412_POSITION        0x0000000C
#define _GLCDCURDATA97_PIXEL2412_MASK            0x0000F000
#define _GLCDCURDATA97_PIXEL2412_LENGTH          0x00000004

#define _GLCDCURDATA97_PIXEL2411_POSITION        0x00000010
#define _GLCDCURDATA97_PIXEL2411_MASK            0x000F0000
#define _GLCDCURDATA97_PIXEL2411_LENGTH          0x00000004

#define _GLCDCURDATA97_PIXEL2410_POSITION        0x00000014
#define _GLCDCURDATA97_PIXEL2410_MASK            0x00F00000
#define _GLCDCURDATA97_PIXEL2410_LENGTH          0x00000004

#define _GLCDCURDATA97_PIXEL249_POSITION         0x00000018
#define _GLCDCURDATA97_PIXEL249_MASK             0x0F000000
#define _GLCDCURDATA97_PIXEL249_LENGTH           0x00000004

#define _GLCDCURDATA97_PIXEL248_POSITION         0x0000001C
#define _GLCDCURDATA97_PIXEL248_MASK             0xF0000000
#define _GLCDCURDATA97_PIXEL248_LENGTH           0x00000004

#define _GLCDCURDATA98_PIXEL2423_POSITION        0x00000000
#define _GLCDCURDATA98_PIXEL2423_MASK            0x0000000F
#define _GLCDCURDATA98_PIXEL2423_LENGTH          0x00000004

#define _GLCDCURDATA98_PIXEL2422_POSITION        0x00000004
#define _GLCDCURDATA98_PIXEL2422_MASK            0x000000F0
#define _GLCDCURDATA98_PIXEL2422_LENGTH          0x00000004

#define _GLCDCURDATA98_PIXEL2421_POSITION        0x00000008
#define _GLCDCURDATA98_PIXEL2421_MASK            0x00000F00
#define _GLCDCURDATA98_PIXEL2421_LENGTH          0x00000004

#define _GLCDCURDATA98_PIXEL2420_POSITION        0x0000000C
#define _GLCDCURDATA98_PIXEL2420_MASK            0x0000F000
#define _GLCDCURDATA98_PIXEL2420_LENGTH          0x00000004

#define _GLCDCURDATA98_PIXEL2419_POSITION        0x00000010
#define _GLCDCURDATA98_PIXEL2419_MASK            0x000F0000
#define _GLCDCURDATA98_PIXEL2419_LENGTH          0x00000004

#define _GLCDCURDATA98_PIXEL2418_POSITION        0x00000014
#define _GLCDCURDATA98_PIXEL2418_MASK            0x00F00000
#define _GLCDCURDATA98_PIXEL2418_LENGTH          0x00000004

#define _GLCDCURDATA98_PIXEL2417_POSITION        0x00000018
#define _GLCDCURDATA98_PIXEL2417_MASK            0x0F000000
#define _GLCDCURDATA98_PIXEL2417_LENGTH          0x00000004

#define _GLCDCURDATA98_PIXEL2416_POSITION        0x0000001C
#define _GLCDCURDATA98_PIXEL2416_MASK            0xF0000000
#define _GLCDCURDATA98_PIXEL2416_LENGTH          0x00000004

#define _GLCDCURDATA99_PIXEL2431_POSITION        0x00000000
#define _GLCDCURDATA99_PIXEL2431_MASK            0x0000000F
#define _GLCDCURDATA99_PIXEL2431_LENGTH          0x00000004

#define _GLCDCURDATA99_PIXEL2430_POSITION        0x00000004
#define _GLCDCURDATA99_PIXEL2430_MASK            0x000000F0
#define _GLCDCURDATA99_PIXEL2430_LENGTH          0x00000004

#define _GLCDCURDATA99_PIXEL2429_POSITION        0x00000008
#define _GLCDCURDATA99_PIXEL2429_MASK            0x00000F00
#define _GLCDCURDATA99_PIXEL2429_LENGTH          0x00000004

#define _GLCDCURDATA99_PIXEL2428_POSITION        0x0000000C
#define _GLCDCURDATA99_PIXEL2428_MASK            0x0000F000
#define _GLCDCURDATA99_PIXEL2428_LENGTH          0x00000004

#define _GLCDCURDATA99_PIXEL2427_POSITION        0x00000010
#define _GLCDCURDATA99_PIXEL2427_MASK            0x000F0000
#define _GLCDCURDATA99_PIXEL2427_LENGTH          0x00000004

#define _GLCDCURDATA99_PIXEL2426_POSITION        0x00000014
#define _GLCDCURDATA99_PIXEL2426_MASK            0x00F00000
#define _GLCDCURDATA99_PIXEL2426_LENGTH          0x00000004

#define _GLCDCURDATA99_PIXEL2425_POSITION        0x00000018
#define _GLCDCURDATA99_PIXEL2425_MASK            0x0F000000
#define _GLCDCURDATA99_PIXEL2425_LENGTH          0x00000004

#define _GLCDCURDATA99_PIXEL2424_POSITION        0x0000001C
#define _GLCDCURDATA99_PIXEL2424_MASK            0xF0000000
#define _GLCDCURDATA99_PIXEL2424_LENGTH          0x00000004

#define _GLCDCURDATA100_PIXEL257_POSITION        0x00000000
#define _GLCDCURDATA100_PIXEL257_MASK            0x0000000F
#define _GLCDCURDATA100_PIXEL257_LENGTH          0x00000004

#define _GLCDCURDATA100_PIXEL256_POSITION        0x00000004
#define _GLCDCURDATA100_PIXEL256_MASK            0x000000F0
#define _GLCDCURDATA100_PIXEL256_LENGTH          0x00000004

#define _GLCDCURDATA100_PIXEL255_POSITION        0x00000008
#define _GLCDCURDATA100_PIXEL255_MASK            0x00000F00
#define _GLCDCURDATA100_PIXEL255_LENGTH          0x00000004

#define _GLCDCURDATA100_PIXEL254_POSITION        0x0000000C
#define _GLCDCURDATA100_PIXEL254_MASK            0x0000F000
#define _GLCDCURDATA100_PIXEL254_LENGTH          0x00000004

#define _GLCDCURDATA100_PIXEL253_POSITION        0x00000010
#define _GLCDCURDATA100_PIXEL253_MASK            0x000F0000
#define _GLCDCURDATA100_PIXEL253_LENGTH          0x00000004

#define _GLCDCURDATA100_PIXEL252_POSITION        0x00000014
#define _GLCDCURDATA100_PIXEL252_MASK            0x00F00000
#define _GLCDCURDATA100_PIXEL252_LENGTH          0x00000004

#define _GLCDCURDATA100_PIXEL251_POSITION        0x00000018
#define _GLCDCURDATA100_PIXEL251_MASK            0x0F000000
#define _GLCDCURDATA100_PIXEL251_LENGTH          0x00000004

#define _GLCDCURDATA100_PIXEL250_POSITION        0x0000001C
#define _GLCDCURDATA100_PIXEL250_MASK            0xF0000000
#define _GLCDCURDATA100_PIXEL250_LENGTH          0x00000004

#define _GLCDCURDATA101_PIXEL2515_POSITION       0x00000000
#define _GLCDCURDATA101_PIXEL2515_MASK           0x0000000F
#define _GLCDCURDATA101_PIXEL2515_LENGTH         0x00000004

#define _GLCDCURDATA101_PIXEL2514_POSITION       0x00000004
#define _GLCDCURDATA101_PIXEL2514_MASK           0x000000F0
#define _GLCDCURDATA101_PIXEL2514_LENGTH         0x00000004

